FKDD_COPY_DIFF_3_2026-02-13/BusinessProcesses/БТ_СогласованиеЗаявокДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<BusinessProcess>
		<Properties>
			<Name>БТ_СогласованиеЗаявокДДС</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Task>Task.БТ_ЗадачиОбработкиЗаявокПользователя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отклонил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтменыЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопОпция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРасходДС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/БТ_РолиАдресатовЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>БТ_РолиАдресатовЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СотрудникЦФО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительЦФО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бухгалтерия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенеральныйДиректорДЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФинансовыйДиректор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенеральныйДиректорУК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казначей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенеральныйДиректорИД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/БТ_СтатусыЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>БТ_СтатусыЗаявки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоНаДоработку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/BusinessProcesses/БТ_СогласованиеЗаявокДДС/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьКартинкуКнопкиПолногоСписка(Ложь);
	УстановитьКартинкуКнопкиИнформационнаяПанель(Ложь);   
	
	СоздатьВводНаОсновании( "Команда", "Осн", истина);

КонецПроцедуры 

Процедура СоздатьВводНаОсновании(ПрифексКоманды, ПрифексИмени,ТолькоВоВсехДействиях)       
	
	имяМД = "ЗаявкаНаРасходДС"; 
	
	Для каждого стр из Метаданные.Документы Цикл     
		
		Для каждого Ст из стр.ВводитсяНаОсновании Цикл   
			
			Если Ст.Имя = ИмяМД Тогда 
				
				ИмяКоманды = ПрифексКоманды+стр.ИМЯ;
				Команда = Команды.Добавить(ИмяКоманды);
				Команда.Действие = "Ввод";   
				
				Элемент = Элементы.Добавить(ПрифексИмени+стр.ИМЯ,  Тип("КнопкаФормы"),Элементы.СоздатьДокументы);
				Элемент.Заголовок = стр.Синоним;
				Элемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;  
				
				Если ТолькоВоВсехДействиях Тогда    
					
					Элемент.ТолькоВоВсехДействиях     = Ложь;
					
				КонецЕсли;                              
				
				Элемент.ИмяКоманды                = ИмяКоманды;    // Элементы.СписокКонтекстноеМенюЗамена
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры      

&НаКлиенте
Процедура Ввод(Команда)  
	
	док = Прав(Команда.Имя, СтрДлина(Команда.Имя) - 7);   
	
	ТекДанные = Элементы.ЗаявкиНаУтверждении.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДокЗаявка 	= БТ_СлужебныеФункции.ПолучитьЗначениеРеквизита(ТекДанные.Заявка, "ЗаявкаНаРасходДС");

	ДокСоздания = Документы[док].СоздатьДокумент();
	ДокСоздания.Заполнить(ДокЗаявка);
	ОткрытьЗначение(ДокСоздания);      
	
КонецПроцедуры


&НаКлиенте
Процедура ОписаниеЗаявкиОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ПолученноеЗначение = ПолучитьДанныеФайлаИзВременногоХранилища(Расшифровка, АдресДанныхРасшифровкиОписаниеЗаявки);
	Если ТипЗнч(ПолученноеЗначение) = Тип("Структура") Тогда       
		
		ЗапуститьПриложение(ПолученноеЗначение.ИмяФайла);
		
		//РаботаСХранилищемКлиент.ВыбратьФайл(Новый Структура("ИмяФайла,Расширение", ПолученноеЗначение.ИмяФайла, ПолученноеЗначение.Расширение), СтруктураЗаявокТабличныхДокументов.Основная,, Истина);
	ИначеЕсли ПолученноеЗначение = "Добавить вложение в заявку" Тогда
			
		Если НЕ ЗначениеЗаполнено(СтруктураЗаявокТабличныхДокументов.Основная) Тогда
			Возврат;
		КонецЕсли;
		
		//РаботаСХранилищемКлиент.ПрикрепитьФайлКЗаявке(СтруктураЗаявокТабличныхДокументов.Основная, Ложь,,,, Новый ОписаниеОповещения("ПослеПомещенияВложенияИзСписка",ЭтотОбъект, Новый Структура("ОбновитьИнфоПанель, Заявка", Истина, СтруктураЗаявокТабличныхДокументов.Основная)));
	ИначеЕсли ПолученноеЗначение <> Неопределено Тогда
		ПоказатьЗначение(, ПолученноеЗначение);
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаУтвержденииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	//СтандартнаяОбработка = Ложь;
	ЗаполнитьТекущиеРеквизитыНаКлиенте();
	
	Если Элементы.ИнформационнаяПанель.Пометка Тогда
	
		УстановитьКартинкуКнопкиИнформационнаяПанель(Истина);
		ОбновитьСведенияПоТекущейЗаявкеНаКлиенте(Истина);
		
	КонецЕсли;          
	
	ТекущиеДанные =	Элементы.ЗаявкиНаУтверждении.ТекущиеДанные;
	РодительКазначей = не ТекущиеДанные = Неопределено и не ТекущиеДанные.РодительскаяГруппировкаСтроки = Неопределено 
		и ТекущиеДанные.РодительскаяГруппировкаСтроки.Ключ = ПредопределенноеЗначение("Перечисление.БТ_РолиАдресатовЗаявок.Казначей");
		
	СтандартнаяОбработка = не РодительКазначей и не ТекущиеДанные.РодительскаяГруппировкаСтроки = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗаполнитьТекущиеРеквизитыНаКлиенте();
	УстановитьКартинкуКнопкиИнформационнаяПанель(Истина);
	ОбновитьСведенияПоТекущейЗаявкеНаКлиенте(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ЗаполнитьТекущиеРеквизитыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаУтвержденииПриАктивизацииСтроки(Элемент)  
	
	ТекущиеДанные =	Элементы.ЗаявкиНаУтверждении.ТекущиеДанные;
	
	РодительКазначей = ложь;
	//не ТекущиеДанные = Неопределено и не ТекущиеДанные.РодительскаяГруппировкаСтроки = Неопределено 
	//	и ТекущиеДанные.РодительскаяГруппировкаСтроки.Ключ = ПредопределенноеЗначение("Перечисление.БТ_РолиАдресатовЗаявок.Казначей");
		
	Элементы.ЗаявкиНаУтвержденииСогласоватьЗаявку.Видимость = не РодительКазначей;
	Элементы.СоздатьДокументы.Видимость	= РодительКазначей;
	
	ЗаполнитьТекущиеРеквизитыНаКлиенте();
	ОбновитьСведенияПоТекущейЗаявкеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПолныйСписок(Команда)
	УстановитьКартинкуКнопкиПолногоСписка();
	//УстановитьПараметрыСпискаЗаявокНаКлиенте(Новый Структура("Завершен, Стартован, ПометкаУдаления", Ложь, Истина, Ложь), НЕ Элементы.ФормаПолныйСписок.Пометка);
КонецПроцедуры

&НаКлиенте
Процедура ИнформационнаяПанель(Команда)
	
	УстановитьКартинкуКнопкиИнформационнаяПанель();
	ОбновитьСведенияПоТекущейЗаявкеНаКлиенте(Истина); 
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфоСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОбновитьСведенияПоТекущейЗаявкеНаКлиенте(Истина); //БизТех 23.10.23г.
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартинкуКнопкиПолногоСписка(Пометка = Неопределено)
	Если Пометка = Неопределено Тогда
		Элементы.ФормаПолныйСписок.Пометка = НЕ Элементы.ФормаПолныйСписок.Пометка;
	Иначе
		Элементы.ФормаПолныйСписок.Пометка = Пометка;
	КонецЕсли;
	Если Элементы.ФормаПолныйСписок.Пометка Тогда
		Элементы.ФормаПолныйСписок.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Иначе
		Если РольДоступна("ПолныеПрава") или РольДоступнаКазначей() Тогда
			Элементы.ФормаПолныйСписок.Отображение = ОтображениеКнопки.Текст; 
		Иначе
			Элементы.ФормаПолныйСписок.Видимость = Ложь;  
		КонецЕсли;
	КонецЕсли; 
	
	ОбновитьДанныеСписка();
КонецПроцедуры   

Функция РольДоступнаКазначей() 
	Запрос = Новый Запрос;
	Запрос.Текст =   "ВЫБРАТЬ
	                 |	БТ_АдресатыЗаявок.ВидЗаявки КАК ВидЗаявки
	                 |ИЗ
	                 |	РегистрСведений.БТ_АдресатыЗаявок КАК БТ_АдресатыЗаявок
	                 |ГДЕ
	                 |	БТ_АдресатыЗаявок.Роль = &Роль
	                 |	И БТ_АдресатыЗаявок.Согласующий = &Согласующий";
	Запрос.УстановитьПараметр("Согласующий", ПараметрыСеанса.Пользователь);  
	Запрос.УстановитьПараметр("Роль", Перечисления.БТ_РолиАдресатовЗаявок.Казначей);
    Рез = Запрос.Выполнить().Выгрузить();
	Если рез.Количество()>0 Тогда
       Возврат Истина;
	Иначе
	   Возврат Ложь;
	КонецЕсли;    
	  
КонецФункции

Процедура ОбновитьДанныеСписка()
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьВсё", Элементы.ФормаПолныйСписок.Пометка);
	
	//Если не РольДоступна("ПолныеПрава") Тогда
		
	ЗаявкиНаУтверждении.Параметры.УстановитьЗначениеПараметра("Пользователь", 		ПараметрыСеанса.Пользователь);
	ЗаявкиНаУтверждении.Параметры.УстановитьЗначениеПараметра("ВсеПользователи", 	Элементы.ФормаПолныйСписок.Пометка);
		
	//КонецЕсли;
	
	Элементы.Список.Обновить();
	Элементы.ЗаявкиНаУтверждении.Обновить();
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартинкуКнопкиИнформационнаяПанель(Пометка = Неопределено)
	Если Пометка = Неопределено Тогда
		Элементы.ИнформационнаяПанель.Пометка = НЕ Элементы.ИнформационнаяПанель.Пометка;
	Иначе
		Элементы.ИнформационнаяПанель.Пометка = Пометка;
	КонецЕсли;
	
	Если Элементы.ИнформационнаяПанель.Пометка Тогда
		Элементы.ИнформационнаяПанель.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Иначе
		Элементы.ИнформационнаяПанель.Отображение = ОтображениеКнопки.Текст;
	КонецЕсли;
	
	Элементы.ИнфоСтраницы.Видимость = Элементы.ИнформационнаяПанель.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыСпискаЗаявокНаКлиенте(СтруктураПараметров, Использование = Истина)
	Для Каждого ЭлементСтруктуры ИЗ СтруктураПараметров Цикл
		Список.Параметры.УстановитьЗначениеПараметра(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
		Список.Параметры.Элементы.Найти(ЭлементСтруктуры.Ключ).Использование = Использование;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСсылкуИзТЧНаКлиенте(ТекущиеДанныеСписка, ИмяПоля, ЗначениеПоУмолчанию = Неопределено)
	ПолученноеЗначение = ЗначениеПоУмолчанию;
	Если ТекущиеДанныеСписка<>Неопределено Тогда
		Попытка
			ПолученноеЗначение = ТекущиеДанныеСписка[ИмяПоля];
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат ПолученноеЗначение;
КонецФункции

&НаКлиенте
Функция ПолучитьТекущийРеквизитНаКлиенте(ИмяПоля, ЗначениеПоУмолчанию)
	ПолученноеЗначение = ЗначениеПоУмолчанию;
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СписокЗаявок Тогда
		ПолученноеЗначение = ПолучитьСсылкуИзТЧНаКлиенте(Элементы.Список.ТекущиеДанные, ИмяПоля, ЗначениеПоУмолчанию);
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.УтверждениеЗаявок Тогда
		ПолученноеЗначение = ПолучитьСсылкуИзТЧНаКлиенте(Элементы.ЗаявкиНаУтверждении.ТекущиеДанные, ИмяПоля, ЗначениеПоУмолчанию);
	КонецЕсли;
	Возврат ПолученноеЗначение;
КонецФункции


&НаКлиенте
Процедура ЗаполнитьТекущиеРеквизитыНаКлиенте()
	//ЗаказПокупателя = ПолучитьТекущийРеквизитНаКлиенте("ЗаказПокупателя", ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка"));
	ЗаявкаПользователя = ПолучитьТекущийРеквизитНаКлиенте("Заявка", ПредопределенноеЗначение("БизнесПроцесс.БТ_СогласованиеЗаявокДДС.ПустаяСсылка"));
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСведенияПоТекущейЗаявке(Заявка, ТабДокОписаниеЗаявки, ТабДокИсторияСогласования, КартаМаршрутаЗаявки,  АдресРасшифровки, АдресДанныхРасшифровкиОписаниеЗаявки)
	БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ОбновитьСведенияПоТекущейЗаявке(Заявка, ТабДокОписаниеЗаявки, ТабДокИсторияСогласования, КартаМаршрутаЗаявки,  АдресРасшифровки, АдресДанныхРасшифровкиОписаниеЗаявки);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗначенияЗаявокТабличныхДокументов()
	СтруктураЗаявокТабличныхДокументов = Новый Структура("Основная, ИсторияСогласования, КартаМаршрута");
КонецПроцедуры

&НаКлиенте
Функция ПроверитьНаРавенствоЗаявокТабличногоДокумента(ИмяТЧ)   
	Если СтруктураЗаявокТабличныхДокументов[ИмяТЧ] = ЗаявкаПользователя Тогда
		Возврат Ложь;
	КонецЕсли; 
	СтруктураЗаявокТабличныхДокументов[ИмяТЧ] = ЗаявкаПользователя;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСведенияПоТекущейЗаявкеНаКлиенте(Принудительно = Ложь)
	Если Элементы.ИнформационнаяПанель.Пометка = Ложь Тогда
		Возврат;
	КонецЕсли;
	Если ЗаявкаПользователя.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	//Если Принудительно Тогда
		ОчиститьЗначенияЗаявокТабличныхДокументов();
	//КонецЕсли;
	
	СтруктураТабличныхДокументов = Новый Структура("ТабДокОписаниеЗаявки, ТабДокИсторияСогласования, КартаМаршрутаЗаявки", Неопределено, Неопределено, Неопределено);
	
	Если Элементы.ИнфоСтраницы.ТекущаяСтраница = Элементы.Основная Тогда
		Если НЕ ПроверитьНаРавенствоЗаявокТабличногоДокумента("Основная") Тогда
			Возврат;
		КонецЕсли;
		СтруктураТабличныхДокументов.Вставить("ТабДокОписаниеЗаявки", ОписаниеЗаявки);
	ИначеЕсли Элементы.ИнфоСтраницы.ТекущаяСтраница = Элементы.ИсторияСогласования Тогда
		Если НЕ ПроверитьНаРавенствоЗаявокТабличногоДокумента("ИсторияСогласования") Тогда
			Возврат;
		КонецЕсли;
		СтруктураТабличныхДокументов.Вставить("ТабДокИсторияСогласования", История);
	ИначеЕсли Элементы.ИнфоСтраницы.ТекущаяСтраница = Элементы.КартаМаршрута Тогда
		Если НЕ ПроверитьНаРавенствоЗаявокТабличногоДокумента("КартаМаршрута") Тогда
			Возврат;
		КонецЕсли;
		СтруктураТабличныхДокументов.Вставить("КартаМаршрутаЗаявки", КартаМаршрутаЗаявки);
	КонецЕсли;
	
	ОбновитьСведенияПоТекущейЗаявке(ЗаявкаПользователя, СтруктураТабличныхДокументов.ТабДокОписаниеЗаявки, СтруктураТабличныхДокументов.ТабДокИсторияСогласования, СтруктураТабличныхДокументов.КартаМаршрутаЗаявки, ЭтотОбъект.УникальныйИдентификатор, АдресДанныхРасшифровкиОписаниеЗаявки);
	
	Для Каждого ТЧ ИЗ СтруктураТабличныхДокументов Цикл
		Если ТЧ.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ТЧ.Ключ = "ТабДокОписаниеЗаявки" Тогда
			ОписаниеЗаявки = ТЧ.Значение;
		ИначеЕсли ТЧ.Ключ = "ТабДокИсторияСогласования" Тогда
			История = ТЧ.Значение;
		ИначеЕсли ТЧ.Ключ = "КартаМаршрутаЗаявки" Тогда
			КартаМаршрутаЗаявки = ТЧ.Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьЗаявку(Команда)
	СогласоватьЗаявкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура СогласоватьЗаявкуНаСервере()
	
	СписокЗаявок = Элементы.ЗаявкиНаУтверждении.ВыделенныеСтроки;
	ТребуетсяОбновление = Ложь;
	СписокЗаявокСогласования = Новый СписокЗначений;
	
	Для Каждого ТекЗаявка из СписокЗаявок Цикл
		
        СписокЗаявокСогласования.Добавить(ТекЗаявка.Ссылка);
		ТребуетсяОбновление = Истина;
		
	КонецЦикла;        
	
	БТ_БизнесПроцессы.СогласоватьЗаявку(СписокЗаявокСогласования);
	
	Если ТребуетсяОбновление Тогда
	
		Элементы.ЗаявкиНаУтверждении.Обновить();
		Элементы.Список.Обновить();      
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьЗаголовок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	БТ_АдресатыЗаявок.Роль КАК Роль
		|ИЗ
		|	РегистрСведений.БТ_АдресатыЗаявок КАК БТ_АдресатыЗаявок
		|ГДЕ
		|	БТ_АдресатыЗаявок.Согласующий = &Согласующий";
	
	Запрос.УстановитьПараметр("Согласующий", ПараметрыСеанса.Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПредставлениеРолей = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПредставлениеРолей = ПредставлениеРолей + ?(ПустаяСтрока(ПредставлениеРолей), "", ",") + ВыборкаДетальныеЗаписи.Роль;
		
	КонецЦикла;
	
    Заголовок = "Журнал согласования заявок на расход ДС: " + ПредставлениеРолей;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДанныеСписка();
	ОбновитьЗаголовок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьФорму" Тогда
		
		Элементы.Список.Обновить();
		Элементы.ЗаявкиНаУтверждении.Обновить();
		
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайлаИзВременногоХранилища(Расшифровка, АдресДанныхРасшифровки)
	СтруктураДанныхРасшифровки = ПолучитьИзВременногоХранилища(АдресДанныхРасшифровки);
	ЭлементРасшифровки = СтруктураДанныхРасшифровки.Элементы.Получить(Расшифровка).ПолучитьПоля();
	Заявка		= "";
	ИмяФайла	= "";
	Расширение	= "";
	Для каждого ТекЭлемент Из ЭлементРасшифровки Цикл
		Если ТекЭлемент.Поле = "БизнесПроцесс" Тогда
			Заявка	= ТекЭлемент.Значение;
		ИначеЕсли ТекЭлемент.Поле = "ИмяФайла" или  ТекЭлемент.Поле = "ИмяФайлаДоп" Тогда
			ИмяФайла	= ТекЭлемент.Значение;
		ИначеЕсли ТекЭлемент.Поле = "Расширение" или ТекЭлемент.Поле = "РасширениеДоп" Тогда
			Расширение	= ТекЭлемент.Значение;
		ИначеЕсли ТекЭлемент.Поле = "ОсновнойЗначение" ИЛИ ТекЭлемент.Поле = "ЗначениеРеквизита" ИЛИ ТекЭлемент.Поле = "ЗначениеТЧ" ИЛИ ТекЭлемент.Поле = "ПараметрыДанных.Заявка" Тогда
			Возврат ТекЭлемент.Значение;
		ИначеЕсли ТекЭлемент.Поле = "РегистраторОценки" Тогда
			Возврат ТекЭлемент.Значение;
		ИначеЕсли ТекЭлемент.Поле = "ЗаказПокупателяПросрочка" ИЛИ ТекЭлемент.Поле = "ЗаказПокупателя" Тогда
			Возврат ТекЭлемент.Значение;
		ИначеЕсли ТекЭлемент.Поле = "ДатаПомещения" И (ТекЭлемент.Значение = "Добавить" ИЛИ ТекЭлемент.Значение = "Add") Тогда
			Возврат "Добавить вложение в заявку";
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(ИмяФайла) Тогда
			Возврат Новый Структура("ИмяФайла",  									
										ИмяФайла);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОтказСогласования(Команда)
	
	ВопросПоОтказуСогласования();   
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВопросПоОтказуСогласования()
	
	Причина = "";
	Ответ = Ждать ВвестиСтрокуАсинх(Причина, "Укажите причину отказа", 200);
	
	Если Ответ = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	ПроставитьОтказ(Ответ);    
	Элементы.ЗаявкиНаУтверждении.Обновить();
	Элементы.Список.Обновить();
	
КонецПроцедуры

Процедура ПроставитьОтказ(Причина); 
	СписокЗаявок = Элементы.ЗаявкиНаУтверждении.ВыделенныеСтроки;  
	ТребуетсяОбновление = Ложь;
	СписокЗаявокОтказа	= Новый СписокЗначений;
	Для Каждого ТекЗаявка из СписокЗаявок Цикл
		БПСогласование = ТекЗаявка.Ссылка;
		Если Ложь Тогда
			БПСогласование = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ПустаяСсылка();
		КонецЕсли;
		СписокЗаявокОтказа.Добавить(БПСогласование); 
		ТребуетсяОбновление = Истина;   
	КонецЦикла;                          
	ПроставитьПризнакОтказа(СписокЗаявокОтказа, Причина);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроставитьПризнакОтказа(СписокЗаявокОтказа, Причина)
	
	БТ_БизнесПроцессы.СогласоватьЗаявку(СписокЗаявокОтказа, истина);
	
	Для каждого ТекЗаявка из СписокЗаявокОтказа Цикл
		
		Тема		= СтрШаблон("Отмена согласования документа: %1", БТ_СлужебныеФункции.ПолучитьЗначениеРеквизита(ТекЗаявка.Значение, "ЗаявкаНаРасходДС"));
		БизнесПроцессы.БТ_СогласованиеЗаявокДДС.СформироватьПисьмо(ТекЗаявка.Значение, Тема,, Причина);
		
		Заявка = ТекЗаявка.Значение.ПолучитьОбъект();
		Заявка.Отменен 			= Истина;
		Заявка.ПричинаОтказа 	= Причина;
		Заявка.Отклонил 		= ПараметрыСеанса.Пользователь;
		Заявка.Записать();    
		
		РегистрыСведений.БТ_СтатусыЗаявкиДДС.УстановитьСтатус(Заявка.ЗаявкаНаРасходДС, Перечисления.БТ_СтатусыЗаявки.Отказ);
		
		БТ_БизнесПроцессы.УстановитьСтатусСтрокиЗаявки(ТекЗаявка.Значение, ПредопределенноеЗначение("Перечисление.БТ_СтатусыЗаявок.Отказ"),,,);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СписокЗаявок Тогда
		
		Элементы.Список.Обновить();
		
	Иначе                          
		
		Элементы.ЗаявкиНаУтверждении.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

//<<ЧалапАю БизТех 01.11.2023
&НаКлиенте
Процедура ОтправитьНаДоработку(Команда)      
	ВопросПоДоработкеСогласования();   
КонецПроцедуры 
//ЧалапАю БизТех 01.11.2023>>      

//<<ЧалапАю БизТех 01.11.2023
&НаКлиенте
Асинх Процедура ВопросПоДоработкеСогласования()
	Причина = "";
	Ответ = Ждать ВвестиСтрокуАсинх(Причина, "Укажите причину отправки на доработку", 200);
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ОтправитьНаДоработкуНаСервере(Ответ);    
	Элементы.ЗаявкиНаУтверждении.Обновить();
	Элементы.Список.Обновить();
КонецПроцедуры
//ЧалапАю БизТех 01.11.2023>>      


 //<<ЧалапАю БизТех 01.11.2023
&НаСервере
Процедура ОтправитьНаДоработкуНаСервере(Причина)
	СписокЗаявок = Элементы.ЗаявкиНаУтверждении.ВыделенныеСтроки;  
	ТребуетсяОбновление = Ложь;
	СписокЗаявокНаДоработку	= Новый СписокЗначений;
	Для Каждого ТекЗаявка из СписокЗаявок Цикл
		БПСогласование = ТекЗаявка.Ссылка;
		Если Ложь Тогда
			БПСогласование = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ПустаяСсылка();
		КонецЕсли;
		СписокЗаявокНаДоработку.Добавить(БПСогласование); 
		ТребуетсяОбновление = Истина;   
	КонецЦикла;                          
	ПроставитьПризнакОтправкиНаДоработку(СписокЗаявокНаДоработку, Причина);
КонецПроцедуры
//ЧалапАю БизТех 01.11.2023>>      

&НаСервереБезКонтекста
Процедура ПроставитьПризнакОтправкиНаДоработку(СписокЗаявокНаДоработку, Причина)    
	
	//04.11.2023
	Для каждого СтрЗ из СписокЗаявокНаДоработку цикл
		РегистрыСведений.БТ_СтатусыЗаявкиДДС.УстановитьСтатус(СтрЗ.Значение.ЗаявкаНаРасходДС, Перечисления.БТ_СтатусыЗаявки.ОтправленоНаДоработку);
	КонецЦикла;	
	
	БТ_БизнесПроцессы.СогласоватьЗаявку(СписокЗаявокНаДоработку, ложь, Истина);
    Для каждого ТекЗаявка из СписокЗаявокНаДоработку Цикл
		Тема		= СтрШаблон("Отправка на доработку документа: %1", БТ_СлужебныеФункции.ПолучитьЗначениеРеквизита(ТекЗаявка.Значение, "ЗаявкаНаРасходДС"));   
		БизнесПроцессы.БТ_СогласованиеЗаявокДДС.СформироватьПисьмо(ТекЗаявка.Значение, Тема,, Причина);
		Заявка = ТекЗаявка.Значение.ПолучитьОбъект();
		//Заявка.Отменен 			= Истина;
		Заявка.ПричинаОтказа 	= Причина;
		//Заявка.Отклонил 		= ПараметрыСеанса.Пользователь;
		Заявка.Записать();    
		//РегистрыСведений.БТ_СтатусыЗаявкиДДС.УстановитьСтатус(Заявка.ЗаявкаНаРасходДС, Перечисления.БТ_СтатусыЗаявки.ОтправленоНаДоработку);
		//БТ_БизнесПроцессы.УстановитьСтатусСтрокиЗаявки(ТекЗаявка.Значение, ПредопределенноеЗначение("Перечисление.БТ_СтатусыЗаявок.ОтправленоНаДоработку"),,ПредопределенноеЗначение("Перечисление.БТ_РолиАдресатовЗаявок.СотрудникЦФО"), БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеСотрудникЦФО);
	КонецЦикла;
КонецПроцедуры
